instagramAppNew/app/controllers/numberofposts_controller.rb

  	def show
  		@numberofpost = Numberofpost.find(params[:id])
---
SELECT  "numberofposts".* FROM "numberofposts" WHERE "numberofposts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  	def create
  		@numberofpost = Numberofpost.new(permit_numberofpost)
  		if @numberofpost.save
---
INSERT INTO "numberofposts" ("postnum", "created_at", "updated_at", "preferredname") VALUES (?, ?, ?, ?)  [["postnum", 20], ["created_at", 2017-02-10 21:32:07 UTC], ["updated_at", 2017-02-10 21:32:07 UTC], ["preferredname", "30"]]