instagramAppNew/app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" LIMIT ?  [["LIMIT", 1]]
SELECT "numberofposts".* FROM "numberofposts"
---
  def index
    @numberofposts = Numberofpost.all

INSERT INTO "posts" ("description", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
  	@post = Post.new(permit_post)
  	if @post.save