instagramAppNew/app/views/posts/index.html.erb

SELECT  "posts".* FROM "posts" LIMIT ?  [["LIMIT", 1]]
---
<% @posts.sort_by{|t| - t.created_at.to_i}.first(@numberofposts.sort_by{|t| - t.created_at.to_i}[0].postnum.to_i).each do |x| %>